edit: ignore this comment. it is working now

@arslanbekov even with the terraform code you shared above, I'm getting error

code:
```
terraform {
  required_providers {
    openvpncloud = {
      source = "OpenVPN/openvpn-cloud"
      version = "0.0.7"
    }
  }
}

provider "openvpncloud" {
  base_url = "https://iamunni.api.openvpn.com"
}

resource "openvpncloud_network" "vpn_network" {
  name = "test_network"
  default_connector {
    name          = "test_connector"
    vpn_region_id = "fi-hel"
  }
  default_route {
    value = "10.1.1.0/24"
    type  = "IP_V4"
  }
  provider = openvpncloud
}
```
apply output:
```
Terraform will perform the following actions:

  # openvpncloud_network.vpn_network will be created
  + resource "openvpncloud_network" "vpn_network" {
      + description     = "Managed by Terraform"
      + egress          = true
      + id              = (known after apply)
      + internet_access = "LOCAL"
      + name            = "test_network"
      + system_subnets  = (known after apply)

      + default_connector {
          + id                = (known after apply)
          + ip_v4_address     = (known after apply)
          + ip_v6_address     = (known after apply)
          + name              = "test_connector"
          + network_item_id   = (known after apply)
          + network_item_type = (known after apply)
          + vpn_region_id     = "fi-hel"
        }

      + default_route {
          + id    = (known after apply)
          + type  = "IP_V4"
          + value = "10.1.1.0/24"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
openvpncloud_network.vpn_network: Creating...
╷
│ Error: Status code: 400, Response body: {"path":"/api/beta/networks/e531fcfa-b0e3-49a5-a43c-fdee8267aaa1/routes","requestId":"51370d35-110","status":400,"statusError":"Bad Request","timestamp":1677007262877}
│
│   with openvpncloud_network.vpn_network,
│   on main.tf line 19, in resource "openvpncloud_network" "vpn_network":
│   19: resource "openvpncloud_network" "vpn_network" {
│
╵
```

I can see the network created. but the route is not added
![image](https://user-images.githubusercontent.com/62323890/220440689-4dc92412-1b76-472f-8030-13a7c1eb802f.png)
![image](https://user-images.githubusercontent.com/62323890/220440773-479d4970-7500-44b8-bddd-aefc393f8f41.png)


I dont understand what is causing this. am I missing anything obvious? thinking. I'm able to created the network successfully with same config using the swagger UI.